PANDAS: TRATAMIENTO DE DATOS NULOS O SIN VALOR

In [2]:
import numpy as np
import pandas as pd

In [24]:
#Creamos un diccionario
diccionario = {'A': [4, 5, np.nan], 'B': [6, 1, 5], 'C': [np.nan, 4, np.nan]}
#Creamos un dataframe a partir del diccionario
dataframe = pd.DataFrame(diccionario)

In [25]:
dataframe

     A  B    C
0  4.0  6  NaN
1  5.0  1  4.0
2  NaN  5  NaN

In [26]:
#Borrar las filas con datos nulos
dataframe.dropna()

     A  B    C
1  5.0  1  4.0

In [27]:
#Borrar las columnas con datos nulos
dataframe.dropna(axis=1)

   B
0  6
1  1
2  5

In [28]:
#Si volvemos a visualizar el dataframe observamos que no lo hace de forma definitva. Para que sea de forma definitiva tendríamos
# que ponerle tb inplace=True
dataframe

     A  B    C
0  4.0  6  NaN
1  5.0  1  4.0
2  NaN  5  NaN

In [29]:
#Si queremos rellenar los valores nulos con un valor:
dataframe.fillna(value=100)

       A  B      C
0    4.0  6  100.0
1    5.0  1    4.0
2  100.0  5  100.0

In [30]:
dataframe

     A  B    C
0  4.0  6  NaN
1  5.0  1  4.0
2  NaN  5  NaN

In [31]:
#Podemos pedirle que nos lo rellene con un valor medio
valor_medio = dataframe.mean()
valor_medio

A    4.5
B    4.0
C    4.0
dtype: float64

In [32]:
dataframe.fillna(value=valor_medio)

     A  B    C
0  4.0  6  4.0
1  5.0  1  4.0
2  4.5  5  4.0

AGRUPACIÓN DE DATOS

In [35]:
# Si tenemos un dataframe, vamos a ver como podemos agrupar datos por columnas
diccionario = {'dias': ['dia1', 'dia1', 'dia2', 'dia2', 'dia3'], 'vendedores': ['Antonio', 'Maria', 'Jose', 'Marta', 'Juan'],
              'ventas': [100, 400, 200, 500, 300]}

In [36]:
dataframe2 = pd.DataFrame(diccionario)

In [37]:
dataframe2

   dias vendedores  ventas
0  dia1    Antonio     100
1  dia1      Maria     400
2  dia2       Jose     200
3  dia2      Marta     500
4  dia3       Juan     300

In [40]:
# Si queremos agrupar los datos de ventas por dia
dataframe2.groupby('dias')

In [46]:
#Podemos establecer la media de valores del objeto groupby
#ponemos numeric_only=True para eliminar el error al intentar aplicar esto a columnas de texto
dataframe2.groupby('dias').mean(numeric_only=True)

      ventas
dias
dia1   250.0
dia2   350.0
dia3   300.0

#Podemos establecer la suma de valores del objeto groupby
dataframe2.groupby('dias').sum(numeric_only=True)

In [49]:
# Tb podemos obtener estadísticas mediante el método describe()
dataframe2.groupby('dias').describe()

     ventas
      count   mean         std    min    25%    50%    75%    max
dias
dia1    2.0  250.0  212.132034  100.0  175.0  250.0  325.0  400.0
dia2    2.0  350.0  212.132034  200.0  275.0  350.0  425.0  500.0
dia3    1.0  300.0         NaN  300.0  300.0  300.0  300.0  300.0

COMBINAR DATAFRAMES

In [3]:
import numpy as np
import pandas as pd

In [4]:
diccionario = {'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]}

In [9]:
dataframe3 = pd.DataFrame(diccionario)

In [10]:
dataframe3

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [11]:
diccionario4 = {'A': [11, 12, 13], 'B': [14, 15, 16], 'C': [17, 18, 19]}
dataframe4 = pd.DataFrame(diccionario4)

In [12]:
dataframe4

    A   B   C
0  11  14  17
1  12  15  18
2  13  16  19

In [13]:
#Podemos concatenar los datatframes
pd.concat([dataframe3, dataframe4])

    A   B   C
0   1   4   7
1   2   5   8
2   3   6   9
0  11  14  17
1  12  15  18
2  13  16  19

In [14]:
# Si queremos concatenarlo por el otro eje:
pd.concat([dataframe3, dataframe4], axis=1)

   A  B  C   A   B   C
0  1  4  7  11  14  17
1  2  5  8  12  15  18
2  3  6  9  13  16  19